
## Plan Result (terraform/aws/tfaction)

[CI link](https://github.com/boxp/arch/actions/runs/8222424672)


<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.aws.aws_iam_policy.put_tfmigrate_history
  * module.aws.aws_iam_policy.read_tfmigrate_history
  * module.aws.aws_iam_role.terraform_apply
  * module.aws.aws_iam_role.terraform_plan
  * module.aws.aws_iam_role.tfmigrate_apply
  * module.aws.aws_iam_role.tfmigrate_plan
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_put_tfmigrate_history
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_read_tfmigrate_history
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_plan_read_tfmigrate_history


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.aws.aws_iam_policy.put_tfmigrate_history will be created
  + resource "aws_iam_policy" "put_tfmigrate_history" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "GitHubActions_Terraform_AWS_write_tfmigrate_history"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.aws.aws_iam_policy.read_tfmigrate_history will be created
  + resource "aws_iam_policy" "read_tfmigrate_history" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "GitHubActions_Terraform_AWS_read_tfmigrate_history"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::/*"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.aws.aws_iam_role.terraform_apply will be created
  + resource "aws_iam_role" "terraform_apply" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_terraform_apply"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role.terraform_plan will be created
  + resource "aws_iam_role" "terraform_plan" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_terraform_plan"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role.tfmigrate_apply will be created
  + resource "aws_iam_role" "tfmigrate_apply" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_tfmigrate_apply"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role.tfmigrate_plan will be created
  + resource "aws_iam_role" "tfmigrate_plan" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_tfmigrate_plan"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_put_tfmigrate_history will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_apply_put_tfmigrate_history" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_apply"
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_read_tfmigrate_history will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_apply_read_tfmigrate_history" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_apply"
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_plan_read_tfmigrate_history will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_plan_read_tfmigrate_history" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_plan"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":10,"Program":"tfcmt","SHA1":"5a20487d343e55ecd5cb48f4ba67ac9ebc2895e5","Target":"terraform/aws/tfaction","Vars":{},"WorkflowName":"pull_request_target"} -->